#판다스 : 데이터테이블을 다루는 도구
#넘파이를 기본적으로 사용

#데이터 프레임중 하나의 열 : 시리즈(인덱스, 데이터 값, 시리즈 타입으로 구성)

In [1]:
import pandas as pd
import numpy as np

In [2]:
arr = np.arange(100,105)
arr

array([100, 101, 102, 103, 104])

In [3]:
s = pd.Series(arr)
s

0    100
1    101
2    102
3    103
4    104
dtype: int32

In [4]:
s.dtype

dtype('int32')

In [5]:
s = pd.Series(['부장', '차장', '대리', '사원', '인턴'])
s

0    부장
1    차장
2    대리
3    사원
4    인턴
dtype: object

In [6]:
s = pd.Series([91, 2.5, '스포츠', 4.0, 5]) # 이것저것 다 넣으면 object 타입
s

0     91
1    2.5
2    스포츠
3    4.0
4      5
dtype: object

In [7]:
s.index 

#0부터 5개, 1씩 증가

RangeIndex(start=0, stop=5, step=1)

In [8]:
s[0] # 인덱스 번호로 뽑아낼 수 있음=>인덱싱

91

In [9]:
s = pd.Series(['마케팅', '경영', '개발', '기획', '인사'], index=['a', 'b', 'c', 'd', 'e'])
s # Series안에서 직접 인덱스를 붙일 수 있음

a    마케팅
b     경영
c     개발
d     기획
e     인사
dtype: object

In [10]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
s['c']

'개발'

In [12]:
s[2] #기존 숫자 인덱스도 사용가능

'개발'

In [13]:
s[-1] #인덱스를 지정해주고 숫자인덱스로 접근할 때 음수 허용

'인사'

In [14]:
s = pd.Series(['마케팅', '경영', '개발', '기획', '인사'])
s.index = list('abcde') # list로도 따로 지정가능
s

a    마케팅
b     경영
c     개발
d     기획
e     인사
dtype: object

In [15]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [16]:
s.values # 데이터 값만 가져올 수 있음.

array(['마케팅', '경영', '개발', '기획', '인사'], dtype=object)

In [17]:
s.ndim #차원을 불러옴

1

In [18]:
s.shape #데이터의 갯수를 가져옴

(5,)

In [19]:
s = pd.Series(['마케팅', '경영', '개발', '기획', np.nan ]) #NaN : 결측치 데이터 즉, 비어있는 값
s

0    마케팅
1     경영
2     개발
3     기획
4    NaN
dtype: object

In [20]:
s1 = pd.Series([50.0, 51.0, 52.0, 53.0, 54.0]) #연습문제1
s1

0    50.0
1    51.0
2    52.0
3    53.0
4    54.0
dtype: float64

In [21]:
s2 = pd.Series(['apple', np.nan, 'banana', 'kiwi', 'gubong']) #연습문제2
s2

0     apple
1       NaN
2    banana
3      kiwi
4    gubong
dtype: object

In [22]:
s = pd.Series(['손', '김', '박', '육', '현'], index=['a', 'b','c','d','e'])
s[['a','c']] #index가 a, c 인 거만

a    손
c    박
dtype: object

In [23]:
s[[True, True, True, False, False]] #True 인 값만 선택하는 boolean indexing

a    손
b    김
c    박
dtype: object

In [24]:
s = pd.Series([29, 99, np.nan, 100, 49], index = ['a','b','c','d','e'])
s > 50 #조건에 맞는 값만 True로

a    False
b     True
c    False
d     True
e    False
dtype: bool

In [25]:
s[s>50] #True인 값만

b     99.0
d    100.0
dtype: float64

In [26]:
s.isnull() #NaN이면 True를 찾는 함수

a    False
b    False
c     True
d    False
e    False
dtype: bool

In [27]:
s.isna() # 위랑 같은 함수

a    False
b    False
c     True
d    False
e    False
dtype: bool

In [28]:
s[s.isnull()] #NaN값 인 것만 시리즈로

c   NaN
dtype: float64

In [29]:
s.notnull() #반대

a     True
b     True
c    False
d     True
e     True
dtype: bool

In [51]:
s[s.notnull()]

a     29.0
b     99.0
d    100.0
e     49.0
dtype: float64

In [30]:
s[1:3] #1부터 3전까지( 끝 값 포함 X )

b    99.0
c     NaN
dtype: float64

In [31]:
s['b':'d'] #지정한 인덱스 값으로 슬라이싱 하면 끝 값 포함

b     99.0
c      NaN
d    100.0
dtype: float64

In [32]:
# DataFrame : 2차원 데이터 구조, 여러 개의 시리즈 묶음

# --> 열 별로 데이터 타입이 다르다.(시리즈 각각의 데이터 타입을 그대로 유지하며 합쳐줌)
#--> 행과 열 각각 인덱싱 가능

In [33]:
pd.DataFrame([[1,2,3],
             [4,5,6],
             [7,8,9]]) #2차원 list

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [34]:
pd.DataFrame([[1,2,3],
             [4,5,6],
             [7,8,9]], columns=['가', '나', '다']) #열 이름

   가  나  다
0  1  2  3
1  4  5  6
2  7  8  9

In [35]:
data = {
    'name' : ['Kim', 'Lee', 'Park'],
    'age' : [24, 27, 34],
    'children' : [2, 1, 3]
}
df = pd.DataFrame(data) #dictionary로 생성도 가능
df

   name  age  children
0   Kim   24         2
1   Lee   27         1
2  Park   34         3

In [36]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [37]:
df.columns

Index(['name', 'age', 'children'], dtype='object')

In [38]:
df.values

array([['Kim', 24, 2],
       ['Lee', 27, 1],
       ['Park', 34, 3]], dtype=object)

In [39]:
df.dtypes

name        object
age          int64
children     int64
dtype: object

In [40]:
df.T #전치

            0    1     2
name      Kim  Lee  Park
age        24   27    34
children    2    1     3

In [41]:
df.index = list('abc') #행 이름 저장
df

   name  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [42]:
df.name # name 데이터 시리즈

a     Kim
b     Lee
c    Park
Name: name, dtype: object

In [43]:
type(df['name'])

pandas.core.series.Series

In [44]:
df[['name','children']] # 2개 이상 선택하면 그 columns만 가져옴

   name  children
a   Kim         2
b   Lee         1
c  Park         3

In [45]:
df.rename(columns={'name':'이름'}) # rename으로 열 이름 변경

     이름  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [46]:
df.rename({'name':'이름'}, axis=1) #columns를 빼고 1번째 열 지정해서 rename

     이름  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [47]:
df.rename(columns={'name':'이름'}, inplace=True) # inplace=True 로 df 바로 변경 가능
df

     이름  age  children
a   Kim   24         2
b   Lee   27         1
c  Park   34         3

In [48]:
df = pd.DataFrame({
    'food' : ['KFC', 'McDonald', 'SchoolFood'],
    'price' : [1000, 20000, 2500],
    'rating' : [4.5, 3.9, 4.2]
})
df #연습문제

         food  price  rating
0         KFC   1000     4.5
1    McDonald  20000     3.9
2  SchoolFood   2500     4.2

In [49]:
df[['food', 'rating']] #연습문제

         food  rating
0         KFC     4.5
1    McDonald     3.9
2  SchoolFood     4.2

In [50]:
df.rename(columns={'food':'place'}) #연습문제

        place  price  rating
0         KFC   1000     4.5
1    McDonald  20000     3.9
2  SchoolFood   2500     4.2